// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// Console.Write("Введите пятизначное число:  ");
// string number = Console.ReadLine()!;
// int n = number.Length;
// if (n!=5)
// {
//     Console.Write($"{number} не пятизначное то число");

// }
// else if(number[0] == number[4] && number[1] == number[3])
// {
//     Console.WriteLine($"{number} полиандр");
// }
//     else {
//     Console.WriteLine($"{number} обычное число");
// }

// Задача 23

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125



// Console.Write("Введите положительное число: ");
// int num = int.Parse(Console.ReadLine()!);
// int start = 1;
// if(num <= 0){
// Console.Write("Число должно быть больше нуля");
// }
// else{
// while (start <= num)
// {
//     double s = Math.Pow(start, 3);

//     Console.Write($"{s }, ");
//     start++;
// }
// }